- elm-repl
```

    > 1 / 2
    0.5 : Float
    > List.length [1,2,3,4]
    4 : Int
    > String.reverse "u4bi"
    "ibu4" : String
    > :exit
```